GenevGitHub/Genev_CC2652R7_Firmware/Application/brake_and_throttle.c
    }
    else
    {
        IQ_input = 0;
        IQ_applied = IQ_input;
    }


    /********************************************************************************************************************************
     * Update IQ_applied to STM32MCPDArray.IQ_value fot commanding Motor via motor controller
     ********************************************************************************************************************************/
    ptr_bat_STM32MCPDArray->IQ_value = IQ_applied;

    // in "brakeAndThrottle_CB(allowableRPM, IQ_input, brakeAndThrottle_errorMsg)", brakeAndThrottle_errorMsg is sent to the motor control unit for error handling if necessary.
    // Add one more conditions in order to fed the power into the motor controller
    // if DRIVE_START == 1 -> then run the command for dynamic Iq, otherwise: ignore it!
//#ifdef CC2640R2_GENEV_5X5_ID

//    motor_control_setIQvalue();         //  this is moved to GPT main loop under N = 1.

//#endif    //CC2640R2_GENEV_5X5_ID

    /***** Increments brakeAndThrottleIndex by 1  ***/
    brakeAndThrottleIndex++;
    if (brakeAndThrottleIndex >= BRAKE_AND_THROTTLE_SAMPLES)
    {
        brakeAndThrottleIndex = 0;
    }

}

/*********************************************************************
 * @fun    brake_and_throttle_normalLawControl
 *
 * @brief   Normal Law Algorithm
 *
 * @param   Nil
 *
 * @return  Nil
 *********************************************************************/
uint32_t    normalLaw_count = 0;

static void brake_and_throttle_normalLawControl()
{
    uint16_t RPM_0;
    if (RPM_temp < 1)
    {
        RPM_0 = 1;  // for preventing division by 0 only
    }
    else
    {
        RPM_0 = RPM_temp;
    }

    /***   1. Speed limit Protection  ****/
    if (IQ_input == 0)
    {
        IQ_applied = IQ_input;
    }
    else // (IQ_input > 0)    // i.e. (IQ_input != 0)
    {
        if (( RPM_temp < allowableRPM ) && (!limit_exceedance_flag))
        {
            IQ_applied = IQ_input;
        }
        else if (( RPM_temp >= allowableRPM ) && (!limit_exceedance_flag))
        {
            speedModFactor = pow((allowableRPM/(float)RPM_0), exponent);
            IQ_applied = (float)speedModFactor * IQ_input;
            limit_exceedance_flag = 1;
        }
        else if (( RPM_temp >= allowableRPM ) && (limit_exceedance_flag))
        {
            speedModFactor = pow((allowableRPM/(float)RPM_0), exponent);
            IQ_applied = (float)speedModFactor * IQ_applied;
        }
        else if ((RPM_temp < allowableRPM) && (limit_exceedance_flag))    // when (RPM_temp >= allowableRPM), speedModFactor is less than or equal to 1.
        {
            IQ_applied = IQ_input * 0.5;
            limit_exceedance_flag = 0;
        }
    }

    /***  2. Output Power Limit Protection  *****/
    if ((REG_MAXPOUT / (RPM_0 * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT) > 0xFFFF)
    {
        IQ_maxPout = 0xFFFF;    // caps the maximum IQ_maxPout value to 0xFFFF
    }
    else
    {
        IQ_maxPout = REG_MAXPOUT / (RPM_0 * 2 * PI_CONSTANT / 60) / KT_CONSTANT / KIQ_CONSTANT;
    }

    if (IQ_applied > IQ_maxPout)
    {
        IQ_applied = IQ_maxPout;    // making sure IQ applied will not exceed regulatory output power limit
    }

    /***  3. Input and applied IQ comparator - making sure applied is never greater than user input  *****/
    if (IQ_applied > IQ_input)
    {
        IQ_applied = IQ_input;
    }

    normalLaw_count++;  // for debugging

}


/*********************************************************************
 * @fn      brakeAndThrottle_getSpeedModeParams
 *
 * @brief   Get speed Mode parameters
 *
 * @param   speedMode
 *
 * @return  none
 *********************************************************************/
extern void brake_and_throttle_getSpeedModeParams()
{
    switch(speedMode)
    {
    case BRAKE_AND_THROTTLE_SPEED_MODE_AMBLE:                   // Amble mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_AMBLE;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_AMBLE;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_AMBLE;
            break;
        }
    case BRAKE_AND_THROTTLE_SPEED_MODE_LEISURE:                 // Leisure mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_LEISURE;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_LEISURE;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_LEISURE;
            break;
        }
    case BRAKE_AND_THROTTLE_SPEED_MODE_SPORTS:                  // Sports mode
        {
            if (ControlLaw == BRAKE_AND_THROTTLE_DIRECTLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS * 1.5;
            }
            else if (ControlLaw == BRAKE_AND_THROTTLE_NORMALLAW)
            {
                reductionRatio = BRAKE_AND_THROTTLE_SPEED_MODE_REDUCTION_RATIO_SPORTS;
                allowableRPM = BRAKE_AND_THROTTLE_MAXSPEED_SPORTS;
            }
            rampRate = BRAKE_AND_THROTTLE_RAMPRATE_SPORTS;
            break;
        }
    default:
        break;
    }
    speedModeIQmax = reductionRatio * STM32MCP_TORQUEIQ_MAX / 100;

    /* Send updated speed mode parameters to motor control unit */
    /*  these following codes are necessary for control law change  */
    ptr_bat_STM32MCPDArray->speed_mode = speedMode;
    ptr_bat_STM32MCPDArray->speed_mode_IQmax = speedModeIQmax;
    ptr_bat_STM32MCPDArray->ramp_rate = rampRate;
    ptr_bat_STM32MCPDArray->allowable_rpm = allowableRPM;
    /* call to update and execute speed mode change on MCU */
    motor_control_speedModeParamsChg();   // Note STM32MCP functions have been commented out for debugging purposes

